# LiningThickness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..LiningThickness Property
FabricationPart Class See Also
---
The lining thickness of the fabrication part. If the fabrication part is not lined, returns zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double LiningThickness { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LiningThickness As Double
	Get
```

Visual C++
---
```text
public:
property double LiningThickness {
	double get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace